lucckb/isixrtos/libstm32/inc/stm32usart.h
/*
 * stm32usart.h
 *
 *  Created on: 23 lis 2013
 *      Author: lucck
 */

#ifndef STM32USART_H_
#define STM32USART_H_

#include <stdint.h>
#include <stdbool.h>
#include <stm32rcc.h>
#include "stm32lib.h"


#define CR1_CLEAR_MASK            ((stm32_usart_reg_t)(USART_CR1_M | USART_CR1_PCE | \
                                              USART_CR1_PS | USART_CR1_TE | \
                                              USART_CR1_RE))


/*!< USART CR2 register clock bits clear Mask ((~(uint16_t)0xF0FF)) */
#define CR2_CLOCK_CLEAR_MASK      ((stm32_usart_reg_t)(USART_CR2_CLKEN | USART_CR2_CPOL | \
                                              USART_CR2_CPHA | USART_CR2_LBCL))

/*!< USART CR3 register clear Mask ((~(uint16_t)0xFCFF)) */
#define CR3_CLEAR_MASK            ((stm32_usart_reg_t)(USART_CR3_RTSE | USART_CR3_CTSE))


/*!< USART Interrupts mask */
#if USART_HARDWARE_VERSION == 2
#define IT_MASK                   ((stm32_usart_reg_t)0x000000FF)
#else
#define IT_MASK                   ((stm32_usart_reg_t)0x001F)
#endif


#ifdef __cplusplus
namespace stm32 {
#endif


static inline void usart_set_baudrate( USART_TypeDef* USARTx, 
		uint32_t baudrate, unsigned pclk1, unsigned pclk2 )
{  
  uint32_t tmpreg = 0x00, apbclock = 0x00;

#if USART_HARDWARE_VERSION == 2
  uint32_t divider = 0;
#else
  uint32_t integerdivider = 0x00;
  uint32_t fractionaldivider = 0x00;
#endif
#ifdef USART6
  if ((USARTx == USART1) || (USARTx == USART6))
#else
  if( USARTx == USART1 ) 
#endif
  {
    apbclock = pclk2;
  }
  else
  {
    apbclock = pclk1;
  }

#if USART_HARDWARE_VERSION == 2
 /* Determine the integer part */
  if ((USARTx->CR1 & USART_CR1_OVER8) != 0)
  {
    /* (divider * 10) computing in case Oversampling mode is 8 Samples */
    divider = (uint32_t)((2 * apbclock) / (baudrate));
    tmpreg  = (uint32_t)((2 * apbclock) % (baudrate));
  }
  else /* if ((USARTx->CR1 & CR1_OVER8_Set) == 0) */
  {
    /* (divider * 10) computing in case Oversampling mode is 16 Samples */
    divider = (uint32_t)((apbclock) / (baudrate));
    tmpreg  = (uint32_t)((apbclock) % (baudrate));
  }
  
  /* round the divider : if fractional part i greater than 0.5 increment divider */
  if (tmpreg >=  (baudrate) / 2)
  {
    divider++;
  } 
  
  /* Implement the divider in case Oversampling mode is 8 Samples */
  if ((USARTx->CR1 & USART_CR1_OVER8) != 0)
  {
    /* get the LSB of divider and shift it to the right by 1 bit */
    tmpreg = (divider & (uint16_t)0x000F) >> 1;
    
    /* update the divider value */
    divider = (divider & (uint16_t)0xFFF0) | tmpreg;
  }
  /* Write to USART BRR */
  USARTx->BRR = (uint16_t)divider;
#else
  /* Determine the integer part */
  if ((USARTx->CR1 & USART_CR1_OVER8) != 0)
  {
    /* Integer part computing in case Oversampling mode is 8 Samples */
    integerdivider = ((25 * apbclock) / (2 * (baudrate)));
  }
  else /* if ((USARTx->CR1 & USART_CR1_OVER8) == 0) */
  {
    /* Integer part computing in case Oversampling mode is 16 Samples */
    integerdivider = ((25 * apbclock) / (4 * (baudrate)));
  }
  tmpreg = (integerdivider / 100) << 4;

  /* Determine the fractional part */
  fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

  /* Implement the fractional part in the register */
  if ((USARTx->CR1 & USART_CR1_OVER8) != 0)
  {
    tmpreg |= ((((fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
  }
  else /* if ((USARTx->CR1 & USART_CR1_OVER8) == 0) */
  {
    tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
  }
  /* Write to USART BRR register */
  USARTx->BRR = (uint16_t)tmpreg;
#endif

}

/**
  * @brief  Initializes the USARTx peripheral according to the specified
  *         parameters in the USART_InitStruct .
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or
  *         UART peripheral.
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that contains
  *         the configuration information for the specified USART peripheral.
  * @retval None
  */
static inline void usart_init(USART_TypeDef* USARTx, uint32_t baudrate, uint16_t word_length,
		uint16_t stop_bits, uint16_t parity, uint16_t mode, uint16_t hw_flow_ctl,
		unsigned pclk1, unsigned pclk2)
{


/* Disable USART */
  USARTx->CR1 &= (uint32_t)~((uint32_t)USART_CR1_UE);

  uint32_t tmpreg = USARTx->CR2;

  /* Clear STOP[13:12] bits */
  tmpreg &= (uint32_t)~((uint32_t)USART_CR2_STOP);

  /* Configure the USART Stop Bits, Clock, CPOL, CPHA and LastBit :
      Set STOP[13:12] bits according to USART_StopBits value */
  tmpreg |= (uint32_t)stop_bits;

  /* Write to USART CR2 */
  USARTx->CR2 = tmpreg;


  tmpreg = USARTx->CR1;

  /* Clear M, PCE, PS, TE and RE bits */
  tmpreg &= (uint32_t)~((uint32_t)CR1_CLEAR_MASK);

  /* Configure the USART Word Length, Parity and mode:
     Set the M bits according to USART_WordLength value
     Set PCE and PS bits according to USART_Parity value
     Set TE and RE bits according to USART_Mode value */
  tmpreg |= (uint32_t)word_length | parity | mode;

  /* Write to USART CR1 */
  USARTx->CR1 = tmpreg;


  tmpreg = USARTx->CR3;

  /* Clear CTSE and RTSE bits */
  tmpreg &= (uint32_t)~((uint32_t)CR3_CLEAR_MASK);

  /* Configure the USART HFC :
      Set CTSE and RTSE bits according to USART_HardwareFlowControl value */
  tmpreg |= hw_flow_ctl;

  /* Write to USART CR3 */
  USARTx->CR3 = tmpreg;

  usart_set_baudrate( USARTx, baudrate, pclk1, pclk2 );
}


/**
  * @brief  Initializes the USARTx peripheral Clock according to the
  *         specified parameters in the USART_ClockInitStruct .
  * @param  USARTx: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure that
  *         contains the configuration information for the specified  USART peripheral.
  * @note   The Smart Card and Synchronous modes are not available for UART4 and UART5.
  * @retval None
  */
static inline void usart_clock_init(USART_TypeDef* USARTx, uint32_t clock, uint32_t cpol,
		uint32_t cpha, uint32_t last_bit )
{
  uint32_t tmpreg = 0x00;


