lucckb/isixrtos/libstm32/inc/stm32usart.h
#if USART_HARDWARE_VERSION==2
/**
  * @brief  Enables the specified USART's Request.
  * @param  USARTx: where x can be 1 or 2 or 3 to select the USART peripheral.
  * @param  USART_Request: specifies the USART request.
  *          This parameter can be any combination of the following values:
  *            @arg USART_Request_TXFRQ: Transmit data flush ReQuest
  *            @arg USART_Request_RXFRQ: Receive data flush ReQuest
  *            @arg USART_Request_MMRQ: Mute Mode ReQuest
  *            @arg USART_Request_SBKRQ: Send Break ReQuest
  *            @arg USART_Request_ABRRQ: Auto Baud Rate ReQuest
  * @param  NewState: new state of the DMA interface when reception error occurs.
  *          This parameter can be: ENABLE or DISABLE.  
  * @retval None
  */
static inline void usart_request_cmd(USART_TypeDef* USARTx, uint32_t USART_Request, bool enabled )
{
  if ( enabled)
  {
    /* Enable the USART ReQuest by setting the dedicated request bit in the RQR
       register.*/
    USARTx->RQR |= USART_Request;
  }
  else
  {
    /* Disable the USART ReQuest by clearing the dedicated request bit in the RQR
       register.*/
    USARTx->RQR &= (uint32_t)~USART_Request;
  }
}
/**
  * @brief  Enables or disables the USART's Overrun detection.
  * @param  USARTx: where x can be 1 or 2 or 3 to select the USART peripheral.
  * @param  USART_OVRDetection: specifies the OVR detection status in case of OVR error.
  *          This parameter can be any combination of the following values:
  *            @arg USART_OVRDetection_Enable: OVR error detection enabled when
  *                                            the USART OVR error is asserted.
  *            @arg USART_OVRDetection_Disable: OVR error detection disabled when
  *                                             the USART OVR error is asserted.
  * @retval None
  */
static inline void usart_overrun_detection_config(USART_TypeDef* USARTx, uint32_t USART_OVRDetection)
{
  /* Clear the OVR detection bit */
  USARTx->CR3 &= (uint32_t)~((uint32_t)USART_CR3_OVRDIS);
  /* Set the new value for the OVR detection bit */
  USARTx->CR3 |= USART_OVRDetection;
}

#endif /* USART_HARDWARE_VERSION==2*/
  

/**
  * @brief  Checks whether the specified USART flag is set or not.
  */
static inline bool usart_get_flag_status(USART_TypeDef* USARTx, uint32_t flag)
{

#if USART_HARDWARE_VERSION==2
	return (USARTx->ISR & flag) != 0;
#else
	return (USARTx->SR & flag) != 0;
#endif
}

/**
  * @brief  Clears the USARTx's pending flags.
  */
static inline void usart_clear_flag(USART_TypeDef* USARTx, uint32_t flag)
{
#if USART_HARDWARE_VERSION==2
  USARTx->ICR = flag;
#else
  USARTx->SR = (uint16_t)~flag;
#endif
}

/**
  * @brief  Checks whether the specified USART interrupt has occurred or not.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or
  *         UART peripheral.
  * @param  USART_IT: specifies the USART interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg USART_IT_CTS    : CTS change interrupt (not available for UART4 and UART5)
  *            @arg USART_IT_LBD    : LIN Break detection interrupt
  *            @arg USART_IT_TXE    : Transmit Data Register empty interrupt
  *            @arg USART_IT_TC     : Transmission complete interrupt
  *            @arg USART_IT_RXNE   : Receive Data register not empty interrupt
  *            @arg USART_IT_IDLE   : Idle line detection interrupt
  *            @arg USART_IT_ORE_RX : OverRun Error interrupt if the RXNEIE bit is set
  *            @arg USART_IT_ORE_ER : OverRun Error interrupt if the EIE bit is set
  *            @arg USART_IT_NE     : Noise Error interrupt
  *            @arg USART_IT_FE     : Framing Error interrupt
  *            @arg USART_IT_PE     : Parity Error interrupt
  * @retval The new state of USART_IT (SET or RESET).
  */
static inline bool usart_get_it_status(USART_TypeDef* USARTx, uint32_t usart_it)
{
  uint32_t bitpos = 0x00, itmask = 0x00, usartreg = 0x00;


  /* Get the USART register index */

#if USART_HARDWARE_VERSION==2
  usartreg = (((uint16_t)usart_it) >> 0x08);
#else
  usartreg = (((uint8_t)usart_it) >> 0x05);
#endif
  /* Get the interrupt position */
  itmask = usart_it & IT_MASK;
  itmask = (uint32_t)0x01 << itmask;

  if (usartreg == 0x01) /* The IT  is in CR1 register */
  {
    itmask &= USARTx->CR1;
  }
  else if (usartreg == 0x02) /* The IT  is in CR2 register */
  {
    itmask &= USARTx->CR2;
  }
  else /* The IT  is in CR3 register */
  {
    itmask &= USARTx->CR3;
  }

#if USART_HARDWARE_VERSION==2
  bitpos = usart_it >> 0x10;
#else
  bitpos = usart_it >> 0x08;
#endif
  bitpos = (uint32_t)0x01 << bitpos;

#if USART_HARDWARE_VERSION==2
  bitpos &= USARTx->ISR;
#else
  bitpos &= USARTx->SR;
#endif
  return ((itmask != (uint16_t)0)&&(bitpos != (uint16_t)0));
}

/**
  * @brief  Clears the USARTx's interrupt pending bits.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or
  *         UART peripheral.
  * @param  USART_IT: specifies the interrupt pending bit to clear.
  *          This parameter can be one of the following values:
  *            @arg USART_IT_CTS:  CTS change interrupt (not available for UART4 and UART5)
  *            @arg USART_IT_LBD:  LIN Break detection interrupt
  *            @arg USART_IT_TC:   Transmission complete interrupt.
  *            @arg USART_IT_RXNE: Receive Data register not empty interrupt.
  *
  * @note   PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun
  *          error) and IDLE (Idle line detected) pending bits are cleared by
  *          software sequence: a read operation to USART_SR register
  *          (USART_GetITStatus()) followed by a read operation to USART_DR register
  *          (USART_ReceiveData()).
  * @note   RXNE pending bit can be also cleared by a read to the USART_DR register
  *          (USART_ReceiveData()).
  * @note   TC pending bit can be also cleared by software sequence: a read
  *          operation to USART_SR register (USART_GetITStatus()) followed by a write
  *          operation to USART_DR register (USART_SendData()).
  * @note   TXE pending bit is cleared only by a write to the USART_DR register
  *          (USART_SendData()).
  *
  * @retval None
  */
static inline void usart_clear_it_pending_bit(USART_TypeDef* USARTx, uint16_t usart_it)
{
  stm32_usart_reg_t bitpos = 0x00, itmask = 0x00;
#if USART_HARDWARE_VERSION==2
  bitpos = usart_it >> 0x10;
#else
  bitpos = usart_it >> 0x08;
#endif
  itmask = ((stm32_usart_reg_t)0x01 << (stm32_usart_reg_t)bitpos);
#if USART_HARDWARE_VERSION==2
  USARTx->ICR = (uint32_t)itmask;
#else
  USARTx->SR = (uint16_t)~itmask;
#endif
}


#undef CR1_CLEAR_MASK
#undef CR3_CLEAR_MASK
#undef CR2_CLOCK_CLEAR_MASK
#undef IT_MASK

#ifdef __cplusplus
}
#endif

#endif /* STM32USART_H_ */

